IoTHomeJM/ESP32_Button_transmitter/src/main.cpp

//#include <Adafruit_SH1106.h>   // oled 1.3 cala
#include <Adafruit_SSD1306.h>  // oled 0.9 cala
#include <Arduino.h>
#include <ArduinoOTA.h>
#include <EEPROM.h>
#include <Fonts/FreeSans12pt7b.h>
#include <Fonts/FreeSansBold24pt7b.h>
#include <LightDimmerESP32.h>
#include <OneButton.h>
#include <OneWire.h>
#include <SPI.h>
#include <Sim800l.h>
#include <SimpleTimer.h>
#include <TimeLib.h>
#include <WebServer.h>
#include <WiFi.h>
#include <Wire.h>
#include <esp32_can.h>
#include <void.h>

#include "RF24.h"
#include "SPIFFS.h"
#include "nRF24L01.h"
int zaok = 5;          // zaokraglenia suwaka jasnosci na oled
int dimActivNumb = 0;  //dla rysowania jasnosci na oled.
bool checkOne1 = 1;

unsigned int czasnazapisweeprom = 6000;  //w milisekundach, 6 sekund, w przypadku brak zmiany jasnosci przez ten czas powoduje zapis w eeprom

//const byte portLED = 19, portLED2 = 18, portLED3 = 17;  // dostepne: DIM1/R - 19 | DIM2/G - 18 | DIM3/B - 17

uint16_t FreqLED = 25000;     // czestotliwosc LED
uint16_t ResolutionLED = 10;  // Rozdzielczosc w bitach.

// zmiennych ponizej nie edytujemy
// unsigned int jasnosc = 0, jasnosc2 = 0, jasnosc3 = 0;  // wykorzystywane do zapisywnie eeprom
unsigned int jasnosc_last = 0;  // !! chyba nigdzie nie jest wykorzystywane
unsigned int jasnosc_max = 0;   // !! chyba nigdzie nie jest wykorzystywane
byte eepromBUF[64];             // bufor dla zapisu/odczytu eeprom
bool zapiszweeprom = 0;
uint64_t aktualnyCzas = 0;
uint64_t zapamietanyCzas1 = 0;
uint64_t zapamietanyCzasEEPROM = 0;
uint64_t zapamietanyCzasOLED = 0;
uint64_t zapczas = 0, zapczas2 = 0;  // dla relaydimonoff();

// LightDimmerESP32 DimLED1;
LightDimmerESP32 led[3];
bool dim1 = 0, dim2 = 0, dim3 = 0, LightOnBoot = 0;
uint8_t DimUpDownResolution = 20;  // szybkosc regulacji jasnosci led za pomoca przycisku

// dla przycisku, regulacja jasnosci
int dimmsetNow[4] = {0};
uint8_t numDIM = 0;
int dimmsetLast[4] = {0};
int dimmsetMax[4] = {999, 999, 999, 999};
int16_t dimmset_now = 0, dimmset_now2 = 0, dimmset_now3 = 0;
// int16_t dimmset_last = 0, dimmset_last2 = 0, dimmset_last3 = 0;
// int16_t dimmset_max = 999, dimm2set_max = 999, dimm3set_max = 999;

int16_t dimmset_min = 2;

//<--Dimmer
//--> server
boolean ServerActive = 1;

char* ssidAP = strdup("SWModule");        // Enter SSID here
char* passwordAP = strdup("1234567890");  // Enter Password here
// char* ssid = strdup("NET2");
// char* password = strdup("Janek1Ewa2-s7");
// char* ssid = strdup("JLU");
//char* password = strdup("1234567890");
char* ssid = strdup("NET");
char* password = strdup("Janek1@$Eva");

String hostname = "SWModule";
WebServer server(80);
bool wifiSTAon = 0, wifiAPon = 1;
uint8_t wifiSTAonCN = 0;
//<--server

//--> CAN-BUS

uint8_t Flag = 0;      // 1 bit
uint8_t SubDevID = 0;  // 4 bity od 0 do 15. wykorzystywane np po to, aby zarzadzac drugim modulem po CAN z tym zamym DevID. Gdy nadajnik i dimmer sa  polaczone z CAN-BUS dajemy w dimmer 1-15
uint8_t DevID = 2;     // 8bit ID tego urzadzenia, ID 1 to master.
uint32_t frameID = 0;
bool allFrame = 0;         // jesli 0 to przyjmuje ramki z filtrem
bool OnDevices[25] = {0};  // lista wlaczonych urzadzen - tylko dla mastera. test
//<-- CAN-BUS

#define eeprom 0x50  // Address of 24LC256 eeprom chip

SimpleTimer timer;

const uint8_t SW1pin = 19, SW2pin = 18, SW3pin = 17, SW4pin = 16;
//const uint8_t SW1pin = 0;
const uint8_t SW1TouchPin = 33;

//--> NRF settings
byte NRFbuf[32] = {0};  // bufor dla nrf
uint32_t RF24_rxAddr = 2138439680;
uint8_t NRFchannel = 1;
uint8_t PALevel = 1;             // 0=MIN, 1=LOW, 2=HIGH, 3=MAX
RF24 radio(27, 15, 14, 12, 13);  //JLU //CE CSN SCK MISO MOSI // ta trzeba uzywac do ESP32 https://github.com/nhatuan84/RF24
//<--NRF

//--> temeratura
OneWire ds(23);
byte DallasAddr[8];
bool CzyJestCzujnikTemperaury = 1;
float celsius = -99;
//<--

//--> dla oled 0.9 cala Declaration for an SSD1306 display connected to I2C (SDA, SCL pins)
#define OLED_RESET -1  // Reset pin # (or -1 if sharing Arduino reset pin)
Adafruit_SSD1306 display(128, 64, &Wire, OLED_RESET);
//<--

//--> dla oled 1.3 cala
//Adafruit_SH1106 display(21, 22);
//<--

// OneButton button(SW1pin, true, 1);
OneButton button(SW1pin, true);   //SW1pin
OneButton button1(SW2pin, true);  //SW2pin
OneButton button2(SW3pin, true);
OneButton button3(SW4pin, true);
bool button_is_long_pressed = 0;
bool dimming_up = 0;
bool poRestarcieTestSW1 = 1;

char timestr[10] = "--:--:--";

boolean SW1TouchEnable = 0;  // aktywacja funkcji przycisku dotyku
boolean SW1TouchActive = 0;  // dotyk uruchamia sie dopiero po inicjalizacji
uint8_t SW1TouchVal = 255;
uint8_t SW1TouchMax = 255;  // ustalana po inicjalizacji wartosc dotyku nie nacisnietego
boolean SW1TouchPressed = 0;
boolean SW1TouchPrevious = 0;
uint8_t SW1TouchFilter = 0;
int SW1TouchValMin = 255;  //tylko do testow

boolean OTAActive = 0, FactorySet = 0, SettingSave = 0;
String json;

Sim800l Sim800l;     //to declare the library
int serialmode = 2;  //0-wylaczony, 1-wlaczoy LOG, 2-wlaczony SIM
String SMSbuf = "";  // bufor SMS
char incomingByte;   // zaciaganie bitow z seriala
bool gsminit = 0, GSMmsg = 0;
uint16_t smsoled = 5000;  // czas wyswietlania sms na OLED

int drvsimreset = 33;
bool oleddim = 0;

int relay[2] = {25, 26};                       // piny fizyczne
bool sp[10] = {0, 0, 0, 0, 0, 0, 0, 0, 0, 0};  // status przekaznikow sp[0],sp[1] - fizyczne
uint16_t relayToff1 = 5;                       // czas opoznienia wylaczenia przekaznika1 w sekundach
uint16_t relayToff2 = 5;
bool roff = 1;

int timerid1, timerid2;
void setup() {
    //--> EEPROM
    Wire.begin(21, 22);  // sda, scl
    Wire.setClock(4000000);
    // nowy modul musi zapisac sobie odpowiednio eeprom
    // if (FactorySet == 1) {
    // delay(1000);
    //         FactoryWriteEEPROM();
    // }
    for (int i = 0; i < 64; ++i) {
        eepromBUF[i] = readEEPROM(i);
    }  // read 32 byte eeprom
    // jasnosc = eepromBUF[0] * 256 + eepromBUF[1];
    // jasnosc2 = eepromBUF[6] * 256 + eepromBUF[7];
    // jasnosc3 = eepromBUF[8] * 256 + eepromBUF[9];
    dimmsetLast[0] = eepromBUF[0] * 256 + eepromBUF[1];
    dimmsetLast[1] = eepromBUF[6] * 256 + eepromBUF[7];
    dimmsetLast[2] = eepromBUF[8] * 256 + eepromBUF[9];
    DevID = eepromBUF[4];
    SubDevID = eepromBUF[5];
    LightOnBoot = eepromBUF[10];
    Flag = eepromBUF[11];
    allFrame = eepromBUF[12];
    PALevel = eepromBUF[13];
    NRFchannel = eepromBUF[14];
    SW1TouchEnable = eepromBUF[15];
    OTAActive = eepromBUF[16];
    ServerActive = eepromBUF[17];
    ResolutionLED = eepromBUF[18];
    FreqLED = eepromBUF[19] * 256 + eepromBUF[20];
    czasnazapisweeprom = eepromBUF[21] * 256 + eepromBUF[22];
    serialmode = eepromBUF[23];
    dimmsetMax[0] = eepromBUF[24] * 256 + eepromBUF[25];
    DimUpDownResolution = eepromBUF[26];
    dimmsetMax[1] = eepromBUF[27] * 256 + eepromBUF[28];
    dimmsetMax[2] = eepromBUF[29] * 256 + eepromBUF[30];
    RF24_rxAddr = (127 << 24) + (118 << 16) + (eepromBUF[31] << 8) + 0;
    relayToff1 = eepromBUF[32] * 256 + eepromBUF[33];
    relayToff2 = eepromBUF[34] * 256 + eepromBUF[35];
    wifiAPon = eepromBUF[36];

    strcpy(ssid, readStringFromEEPROM(2000).c_str());
    strcpy(password, readStringFromEEPROM(2033).c_str());

