IoTHomeJM/ESP32_Button_transmitter/src/main.cpp
    //dimmset_now = jasnosc;

    // konfikuracja poczatkowa przekaznika
    pinMode(relay[0], OUTPUT);
    pinMode(relay[1], OUTPUT);
    digitalWrite(relay[0], sp[0]);
    digitalWrite(relay[1], sp[1]);
    // serialmode = 1;  // !!
    if (serialmode == 1) {
        Serial.begin(115200);      // dla serial monitro
    } else if (serialmode == 2) {  //dla SIM
        Serial.begin(9600);
    } else {
    }

    create_json();

    if (serialmode == 1) {
        Serial.print("json: ");
        Serial.println(json);
        Serial.print("jasnosc: ");
        Serial.println(dimmsetLast[0]);
        Serial.print("jasnosc2: ");
        Serial.println(dimmsetLast[1]);
        Serial.print("jasnosc3: ");
        Serial.println(dimmsetLast[2]);
        Serial.print("DevID: ");
        Serial.println(DevID);
        Serial.print("LightOnBoot: ");
        Serial.println(LightOnBoot);
        Serial.print("PALevel: ");
        Serial.println(PALevel);
        Serial.print("NRFchannel: ");
        Serial.println(NRFchannel);
        Serial.print("SW1TouchEnable: ");
        Serial.println(SW1TouchEnable);
        Serial.print("OTAActive: ");
        Serial.println(OTAActive);
        Serial.print("ServerActive: ");
        Serial.println(ServerActive);
        Serial.print("ResolutionLED: ");
        Serial.println(ResolutionLED);
        Serial.print("FreqLED: ");
        Serial.println(FreqLED);
        Serial.print("czasnazapisweeprom: ");
        Serial.println(czasnazapisweeprom);
        Serial.print("serialmode: ");
        Serial.println(serialmode);
        Serial.print("dimmsetMax[0]: ");
        Serial.println(dimmsetMax[0]);
        Serial.print("dimmsetMax[1]: ");
        Serial.println(dimmsetMax[1]);
        Serial.print("dimmsetMax[2]: ");
        Serial.println(dimmsetMax[2]);
        Serial.print("DimUpDownResolution: ");
        Serial.println(DimUpDownResolution);
        Serial.print("Pelny RF24_rxAddr: ");
        Serial.println(RF24_rxAddr);
        Serial.print("RF24_rxAddr: ");
        Serial.println((RF24_rxAddr >> 8) & 255);
        Serial.print("dimmsetNow[0]: ");
        Serial.println(dimmsetNow[0]);
        Serial.print("dimmsetNow[1]: ");
        Serial.println(dimmsetNow[1]);
        Serial.print("dimmsetNow[2]: ");
        Serial.println(dimmsetNow[2]);
        Serial.print("ssi: ");
        Serial.println(ssid);
        Serial.print("password: ");
        Serial.println(password);
        Serial.print("wifiAPon: ");
        Serial.println(wifiAPon);
    }
    //<-- EEPROM
    /*
    //-->  ESP32 Dimmer settings
    ledcSetup(0, FreqLED, ResolutionLED);  // ledChannel, freq, resolution
    ledcSetup(1, FreqLED, ResolutionLED);
    ledcSetup(2, FreqLED, ResolutionLED);
    // for (uint8_t i = 0; i < 3; i++) {ledcAttachPin(i+17, 0);}

    ledcAttachPin(portLED, 0);
    ledcAttachPin(portLED2, 1);
    ledcAttachPin(portLED3, 2);

    // portLED=19 - led[0], portLED2=18 - led[1], portLED3=17 - led[2];
    led[0].setFadingTime(1000);  // czas od min do max
    led[1].setFadingTime(1000);
    led[2].setFadingTime(1000);
    led[0].setBrighteningTime(300);  // czas od max do min
    led[1].setBrighteningTime(300);
    led[2].setBrighteningTime(300);
    led[0].begin(0, HIGH);
    led[1].begin(1, HIGH);
    led[2].begin(2, HIGH);

    if (LightOnBoot == 1) {  //max jasnosc podczas startu procesora
        //led[0].setupMax(jasnosc);
        dimmsetNow[0] = jasnosc;  // poprwka przekazanie jasnosci on boot z eeprom tez na wyswietlacz
        dim1 = 1;
        jasnoscLED();
    }

    if (serialmode == 1) {
        Serial.print("Nastawy po wlaczeniu: Jasnosc:");
        Serial.print(jasnosc);
        Serial.print(" Jasnosc max:");
        Serial.println(jasnosc_max);
    }
    //<--
    */
    //--> CAN-BUS
    if (CAN0.begin(500000)) {  // predkosc CAN-BUS
        if (allFrame == 0) {
            CAN0.setRXFilter(DevID, 0x000000FF, true);  // przyjmuje ramki tylko o danym ID
            CAN0.setRXFilter(255, 0x000000FF, true);    // ID 255 dla wszystkich urzadzen - np zgloszenie obecnosci do mastera
        } else {
            CAN0.setRXFilter(0, 0, true);  // przyjmuje wszystkie CAN ID
        }
        if (serialmode == 1) {
            Serial.println("CAN ready ...!");
        }
    } else {
        if (serialmode == 1) {
            Serial.println("CAN init failed…");
        }
    }
    //<-- CAN-BUS

    dimmsetMax[0] -= 1;

    button.attachClick(oneClick0);
    button.attachDoubleClick(DoubleClick0);
    button.attachLongPressStart(LongPressStart0);
    button.attachLongPressStop(LongPressStop);

    button1.attachClick(oneClick1);
    button1.attachDoubleClick(DoubleClick1);
    button1.attachLongPressStart(LongPressStart1);
    button1.attachLongPressStop(LongPressStop);

    button2.attachClick(oneClick2);
    button2.attachDoubleClick(DoubleClick2);
    button2.attachLongPressStart(LongPressStart2);
    button2.attachLongPressStop(LongPressStop);

    // button 3 (fizycznie 4) narazie nie obslugiwany
    button3.attachClick(oneClick0);
    button3.attachDoubleClick(DoubleClick0);
    button3.attachLongPressStart(LongPressStart0);
    button3.attachLongPressStop(LongPressStop);
    //--> dla oled 0.9 cala // Address 0x3D for 128x64

    if (!display.begin(SSD1306_SWITCHCAPVCC, 0x3C)) {
        if (serialmode == 1) {
            Serial.println(F("SSD1306 allocation failed"));
        }
        for (;;)
            ;
    }
    //<--

    //--> dla oled 1.3 cala
    //display.begin(SH1106_SWITCHCAPVCC, 0x3C);
    //<--

    //display.dim(1);// jasnosc wyswietlacza oled jesli 1 to przyciemnione

    display.clearDisplay();
    display.display();
    rysujemy_na_lcd();

    radio.begin();
    radio.setChannel(NRFchannel);
    radio.setPayloadSize(3);
    radio.setCRCLength(RF24_CRC_8);
    radio.setPALevel(PALevel);
    radio.setDataRate(RF24_250KBPS);
    radio.setRetries(15, 15);
    radio.openWritingPipe(RF24_rxAddr + 1);  // !!
    radio.openReadingPipe(1, RF24_rxAddr);
    radio.startListening();
    if (serialmode == 1) radio.printDetails();  // wyswietlamy info o parametrach NRF

