IoTHomeJM/ESP32_Button_transmitter/src/main.cpp
    // inicjalizacja czujnika temperatury DS18B20 tj. odczyt jego adresu
    ds.search(DallasAddr);  // NIE WIEM DLACZEGO ALE TRZEBA WYWOLAC 2 RAZY
    if (!ds.search(DallasAddr)) {
        CzyJestCzujnikTemperaury = 0;
    }
    if (OneWire::crc8(DallasAddr, 7) != DallasAddr[7]) {
        CzyJestCzujnikTemperaury = 0;
    }
    if (DallasAddr[0] != 0x28) {
        CzyJestCzujnikTemperaury = 0;
    }

    if (serialmode == 2) {
        int cz = 0;
        while (cz < 20) {
            Serial.println("AT");
            delay(200);
            readSMS();
            if (SMSbuf.indexOf("OK") > -1) {
                SMSbuf = "GSM zainicjowany";
                rysujemy_na_lcd();
                cz = 20;
                gsminit = 1;
            }
            cz++;
        }
        if (gsminit == 1) {
            //delay(1000);
            Serial.println("AT+CMGF=1");  //Ustaw SMS na tryb tekstowy
            delay(1000);
            rysujemy_na_lcd();
            SMSbuf = "";
            Serial.println("AT+CNMI=1,2,0,0,0");  //Procedura obsługi nowo przybyłych wiadomości
            delay(1000);

            rysujemy_na_lcd();
            //Serial.println("AT+CMGL=\"REC UNREAD\"");  // Czytaj Nieprzeczytane wiadomości
        } else {
            SMSbuf = "Nie wykryto GSM";
        }

        rysujemy_na_lcd();
    } else {
        SMSbuf = "GSM wylaczony";
        rysujemy_na_lcd();
    }

    if (!SPIFFS.begin(true)) {
        Serial.println("SPIFFS init error");
        return;
    }  // inicjowanie systemu plikow SPI

    // setTime(1586365689); // ustawia zegarek

    //--> server www
    if (ServerActive == 1) {
        // wifiapstart();
        wifiSTAstart();
        server.on("/headers", []() {  // wysyla naglowki
            server.sendHeader("Access-Control-Allow-Origin", "*");
            server.sendHeader("access-control-allow-credentials", "true");
            server.sendHeader("access-control-allow-headers", "x-requested-with");
            server.sendHeader("access-control-allow-methods", "GET,OPTIONS");
            server.send(200, "text/plain", "OK");
        });
        server.on("/after_loading", []() { create_json(); server.send(200, "application/json", json); });
        server.on("/favicon.ico", []() { server.send(200, "text/plain", "OK"); });
        server.on("/config", HTTP_POST, konfiguracja);
        server.on("/", index_html);
        server.on("/index.html", index_html);
        server.on("/tst", HTTP_GET, handleRoot);      // Call the 'handleRoot' function when a client requests URI "/"
        server.on("/login", HTTP_POST, handleLogin);  // Call the 'handleLogin' function when a POST request is made to URI "/login"

        server.onNotFound(handle_NotFound);
    }
    //<-- server

    //// TIMERY ////
    ///////////////

    timer.setInterval(1000, rysujemy_na_lcd);
    timer.setInterval(2000, InicjacjaOdczytTemperatury);
    if (ServerActive == 1) {
        timerid1 = timer.setInterval(60000, wifiSTAcheck);  // co 5min 300000
        timer.setInterval(150, serverON);                   //1500
        // timerid2 = timer.setTimer(6000, wifiSTAconnecting, 5);
        timerid2 = timer.setInterval(6000, wifiSTAconnecting);
    }
    if (gsminit == 1) {
        timer.setInterval(500, readSMS);
    }

    if (SW1TouchEnable) {
        timer.setTimer(100, InicjacjaSW1Touch, 10);
        touch_pad_init();
        touch_pad_set_fsm_mode(TOUCH_FSM_MODE_TIMER);
        touch_pad_set_voltage(TOUCH_HVOLT_2V7, TOUCH_LVOLT_0V5, TOUCH_HVOLT_ATTEN_1V);
    }
}
////////////////////////////
// LOOP ////////////////////
////////////////////////////

void loop() {
    aktualnyCzas = millis();
    timer.run();
    LightDimmerESP32::update();
    if (SW1TouchActive == 1) {
        sprawdzSW1Touch();
        button.tick(SW1TouchPressed);
    } else {
        button.tick();
        button1.tick();
        button2.tick();
        button3.tick();
    }
    readCAN();
    readNRF();
    relaydimonoff();
    if (button_is_long_pressed == 1) {
        zmiana_poziomu_jasnosci(numDIM);
    }

    if (OTAActive == 1) {
        ArduinoOTA.handle();
    }
    if (FactorySet == 1) {
        FactoryWriteEEPROM();
    }
    if (SettingSave == 1) {
        SettingWriteEEPROM();
    }
    if (zapiszweeprom == 1) {
        DimmWriteEEPROM();
    }  // zapisywanie z opoznieniem aktualnej nastawy jasnosci LED do EEPROM
}
////////////////////////////
// KONIEC LOOP ////////////////////
////////////////////////////

void EnableOTA() {
    ArduinoOTA.begin();
    if (serialmode == 1) Serial.println("OTA aktywne");
}

void readNRF() {
    if (radio.available()) {
        radio.read(&NRFbuf, sizeof(NRFbuf));
        if (serialmode == 1) {
            Serial.print("Wiadomosc NRF");
            Serial.print(NRFbuf[0]);
            Serial.print(", ");
            Serial.println(NRFbuf[2] * 256 + NRFbuf[1]);
        }
        int readNRFID = NRFbuf[0];
        switch (readNRFID) {
            case 1:
                break;
            case 2:
                break;
            case 3:
                dimmsetNow[0] = NRFbuf[2] * 256 + NRFbuf[1];
                dim1 = 1;
                jasnoscLED(0, dimmsetNow[0]);
                if (serialmode == 1) {
                    Serial.print("Jasnosc odebrana z nadajnika:");
                    Serial.println(dimmsetNow[0]);
                }
                break;
            case 4:
                dimmsetNow[1] = NRFbuf[2] * 256 + NRFbuf[1];
                dim2 = 1;
                jasnoscLED(1, dimmsetNow[1]);
                if (serialmode == 1) {
                    Serial.print("Jasnosc odebrana z nadajnika:");
                    Serial.println(dimmsetNow[1]);
                }
                break;
            case 5:
                dimmsetNow[2] = NRFbuf[2] * 256 + NRFbuf[1];
                dim3 = 1;
                jasnoscLED(2, dimmsetNow[2]);
                if (serialmode == 1) {
                    Serial.print("Jasnosc odebrana z nadajnika:");
                    Serial.println(dimmsetNow[2]);
                }
                break;
            case 6: {  // przekaznik wirtualny
                //sp[NRFbuf[1]] = NRFbuf[2];  // nie wiem czy dobrze
            }

            break;
            case 7:
                break;
            case 8:
                break;
            case 9:
                break;
            case 10:
                break;
            case 11:
                break;
            case 12:
                break;
            case 13:
                break;
            case 14:
                break;
            case 15:
                break;
            case 16:
                break;
            case 17:
                break;
            case 18:
                break;
            case 19:
                break;
            case 20:
                break;
            case 21:
                break;
            case 22:
                break;
            case 23:
                break;
            case 24:
                break;
            case 25:
                break;
            case 26:
                break;
            case 27:
                break;
            case 28:
                break;
            case 29:
                break;
            case 30:
                break;
            case 31:
                break;
            case 32:
                break;
            case 33:
                break;
            case 34:
                break;
            case 35:
                break;
            case 36:
                break;
            case 37:
                break;
            case 38:
                break;
            case 39:
                break;
            case 40:
                break;
            case 41:
                break;
            case 42:
                break;
            case 43:
                break;
            case 44:
                break;
            case 45:
                break;
            case 46:
                break;
            case 47:
                break;
            case 48:
                break;
            case 49:
                break;
            case 50:
                break;
        }

    }  // end if radio.available()
}

void sendNRF(uint8_t fnID, uint16_t fndata) {
    bool rslt = 0;
    if (1 == 1) {
        char msg[3];
        msg[0] = fnID;
        msg[1] = (fndata & 0xFF);
        msg[2] = (fndata >> 8);  //forma przekazania bajtu starszego oraz młodszego
        radio.stopListening();

        rslt = radio.write(msg, 3);
        if (serialmode == 1) {
            if (rslt) {
                Serial.println("Dane NRF odebrane");
            } else {
                Serial.println("Tx failed, dane nie odebrane");
            }
        }
    }
    radio.startListening();
}
//--> CAN-BUS
void readCAN() {
    CAN_FRAME inFrame;
    if (CAN0.read(inFrame)) {
        frameID = inFrame.id;  // ID ramki CAN
        uint8_t fnID = frameID >> 21;
        uint8_t flag = (frameID >> 20) & 0x1;
        uint8_t SubDevID = (frameID >> 16) & 0xF;
        uint8_t fromID = (frameID >> 8) & 0xFF;
        uint8_t toID = (frameID)&0xFF;

        if (serialmode == 1) {
            Serial.print("0x");
            Serial.print(frameID, HEX);
            if (inFrame.extended)
                Serial.print(" EX ");
            else
                Serial.print(" ST ");
            Serial.print(inFrame.length, DEC);
            for (int i = 0; i < inFrame.length; i++) {
                Serial.print(inFrame.data.byte[i], HEX);
                Serial.print(" ");
            }
            Serial.println();
            Serial.print(" fnID: ");
            Serial.print(fnID);
            Serial.print(" flag: ");
            Serial.print(flag);
            Serial.print(" SubDevID: ");
            Serial.print(SubDevID);
            Serial.print(" fromID: ");
            Serial.print(fromID);
            Serial.print(" toID: ");
            Serial.print(toID);
            Serial.print(" fndata: ");
            Serial.print(inFrame.data.uint32[0]);
            Serial.print(" fndata2: ");
            Serial.println(inFrame.data.uint32[1]);
        }
        switch (fnID) {
            case 1:  // odpowiadamy masterowi obecnosc urzadzenia na CANie
                sendCAN(1, 1, 0, 0);
                if (serialmode == 1) {
                    Serial.println("fnID 1, ramka wyslana");
                }
                break;
            case 2:  // synchronizacja czasu
                setTime(inFrame.data.uint32[0] + 7200);
                break;
            case 3:  // dimmer 1 // NIE TESTOWANE
                dimmsetNow[0] = inFrame.data.uint16[0];
                dim1 = 1;
                jasnoscLED(0, dimmsetNow[0]);
                break;
            case 4:  // dimmer 2 // NIE TESTOWANE
                dimmsetNow[1] = inFrame.data.uint16[0];
                dim2 = 1;
                jasnoscLED(1, dimmsetNow[1]);
                break;
            case 5:  // dimmer 3 // NIE TESTOWANE
                dimmsetNow[2] = inFrame.data.uint16[0];
                dim3 = 1;
                jasnoscLED(2, dimmsetNow[2]);
                break;
            case 6:  // wszystkie !! NIE TESTOWANE
                dimmsetNow[0] = inFrame.data.uint16[0];
                dim1 = 1;
                jasnoscLED(0, dimmsetNow[0]);
                dimmsetNow[1] = inFrame.data.uint16[1];
                dim2 = 1;
                jasnoscLED(1, dimmsetNow[1]);
                dimmsetNow[2] = inFrame.data.uint16[2];
                dim3 = 1;
                jasnoscLED(2, dimmsetNow[2]);
                if (serialmode == 1) {
                    Serial.print("Jasnosc1: ");
                    Serial.println(dimmsetNow[0]);
                    Serial.print("Jasnosc2: ");
                    Serial.println(dimmsetNow[1]);
                    Serial.print("Jasnosc3: ");
                    Serial.println(dimmsetNow[2]);
                }

                break;
            case 7:
                break;
            case 8:
                break;
            case 9:
                break;
            case 10:
                break;
            case 11:
                break;
            case 12:
                break;
            case 13:
                break;
            case 14:
                break;
            case 15:
                break;
            case 16:
                break;
            case 17:
                break;
            case 18:
                break;
            case 19:
                break;
            case 20:
                break;
            case 21:
                break;
            case 22:
                break;
            case 23:
                break;
            case 24:
                break;
            case 25:
                break;
            case 26:
                break;
            case 27:
                break;
            case 28:
                break;
            case 29:
                break;
            case 30:
                break;
            case 31:
                break;
            case 32:
                break;
            case 33:
                break;
            case 34:
                break;
            case 35:
                break;
            case 36:
                break;
            case 37:
                break;
            case 38:
                break;
            case 39:
                break;
            case 40:
                break;
            case 41:
                break;
            case 42:
                break;
            case 43:
                break;
            case 44:
                break;
            case 45:
                break;
            case 46:
                break;
            case 47:
                break;
            case 48:
                break;
            case 49:
                break;
            case 50:
                break;
        }
    }
}

