IoTHomeJM/ESP32_Button_transmitter/src/main.cpp
void sendCAN(uint8_t toID, uint8_t fnID, uint32_t fndata, uint32_t fndata2) {
    // tworzenie ID RAMKI
    //        | 8bit fnID  |   1bit Flag  | 4bit SubDevID    |  8bit DevID  | 8bit toID |
    frameID = (fnID << 21) + (Flag << 20) + (SubDevID << 16) + (DevID << 8) + toID;

    CAN_FRAME outFrame;
    outFrame.rtr = 0;
    outFrame.id = frameID;
    outFrame.extended = true;
    outFrame.length = 8;
    outFrame.data.uint32[0] = fndata;
    outFrame.data.uint32[1] = fndata2;
    CAN0.sendFrame(outFrame);
    if (serialmode == 1) {
        Serial.print("Can send ID: ");
        Serial.print(frameID, HEX);
        Serial.print(" toID: ");
        Serial.print(toID);
        Serial.print(" fnID: ");
        Serial.print(fnID);
        Serial.print(" fndata: ");
        Serial.println(fndata);
    }
    frameID = 0;
}

//<-- CAN-BUS
//--> server

void wificlose() {
    WiFi.disconnect(true);
    WiFi.mode(WIFI_OFF);
    delay(100);
    ESP.restart();
}
void wifiapstart() {
    if (serialmode == 1) {
        Serial.print("Laczenie wifi AP ");
    }
    timer.disable(timerid1);
    WiFi.persistent(false);
    WiFi.disconnect();
    WiFi.mode(WIFI_OFF);
    //WiFi.mode(WIFI_STA);
    delay(100);

    IPAddress local_ip(192, 168, 1, 100);
    IPAddress gateway(192, 168, 1, 1);
    IPAddress subnet(255, 255, 255, 0);

    WiFi.softAPConfig(local_ip, gateway, subnet);
    WiFi.softAP(ssidAP, passwordAP);
    server.begin();
    zapamietanyCzasOLED = aktualnyCzas;
    SMSbuf = "APmode : 192.168.1.100";
    wifiAPconnected = 1;
}
void wifiSTAstart() {
    if (serialmode == 1) {
        Serial.print("wifiSTAstart ");
    }
    WiFi.persistent(false);
    WiFi.disconnect();
    WiFi.mode(WIFI_OFF);
    delay(100);
    WiFi.mode(WIFI_STA);
    hostname += String(DevID);
    WiFi.setHostname(hostname.c_str());
    WiFi.begin(ssid, password);

    if ((wifiSTAonCN >= 5) && (wifiAPon == 1)) {
        if (serialmode == 1) {
            Serial.print(" Brak polaczenia STA mode. ");
        }
        wifiSTAonCN = 0;
        wifiapstart();
    }
}
void wifiSTAconnecting() {
    if ((WiFi.status() != WL_CONNECTED) && (wifiAPconnected == 0)) {
        wifiSTAon = 0;
        wifiSTAonCN++;
        if (serialmode == 1) {
            Serial.print("Laczenie do WIFI - STA mode. ");
            Serial.println(" Ilosc prob: " + String(wifiSTAonCN) + "");
        }
        wifiSTAstart();
        if (wifiSTAonCN >= 5) {
            wifiSTAonCN = 0;
            timer.disable(timerid2);
            if (serialmode == 1) {
                Serial.println("timerid2 - disable ");
            }
        }

    } else {
        wifiSTAcheck();
    }
}
void wifiSTAcheck() {
    if ((WiFi.status() != WL_CONNECTED) && (wifiAPconnected == 0)) {
        if (serialmode == 1) {
            Serial.println("Brak polaczenia WIFI - STA mode. ");
        }
        wifiSTAonCN = 0;
        timer.enable(timerid2);
        timer.restartTimer(timerid2);
        if (serialmode == 1) {
            Serial.println("timerid2 - enable ");
        }
    } else {
        wifiSTAonCN = 0;
        if (wifiSTAon == 0) {
            wifiSTAon = 1;
            timer.disable(timerid2);  // wifiSTAcheck
            zapamietanyCzasOLED = aktualnyCzas;
            SMSbuf = "IP: " + WiFi.localIP().toString() + "";
            server.begin();
            if (serialmode == 1) {
                Serial.println("HTTP server started");
            }
            if (OTAActive == 1) {
                EnableOTA();
            }
        }
        if (serialmode == 1) {
            if (wifiAPconnected == 1) {
                Serial.print("WiFi AP OK. 192.168.1.100");
            } else {
                Serial.print("WiFi STA OK - IP addres: ");
                Serial.println(WiFi.localIP());
            }
        }
    }
}

void konfiguracja() {
    DevID = server.arg("DevID").toInt();
    SubDevID = server.arg("SubDevID").toInt();
    Flag = server.arg("Flag").toInt();
    allFrame = server.arg("allFrame").toInt();
    PALevel = server.arg("PALevel").toInt();
    NRFchannel = server.arg("NRFchannel").toInt();
    uint8_t RF24_rxAddrTEMP = server.arg("RF24_rxAddr").toInt();
    RF24_rxAddr = (127 << 24) + (118 << 16) + (RF24_rxAddrTEMP << 8) + 0;
    SW1TouchEnable = server.arg("SW1TouchEnable").toInt();
    OTAActive = server.arg("OTAActive").toInt();
    FactorySet = server.arg("FactorySet").toInt();
    ServerActive = server.arg("ServerActive").toInt();
    ResolutionLED = server.arg("ResolutionLED").toInt();
    FreqLED = server.arg("FreqLED").toInt();
    czasnazapisweeprom = server.arg("czasnazapisweeprom").toInt();
    LightOnBoot = server.arg("LightOnBoot").toInt();
    serialmode = server.arg("serialmode").toInt();
    DimUpDownResolution = server.arg("DimUpDownResolution").toInt();
    SettingSave = server.arg("eeprom_save").toInt();

    dimmsetNow[0] = server.arg("jasnosc1").toInt();
    jasnoscLED(0, dimmsetNow[0]);
    dimmsetMax[0] = server.arg("dimmset_max").toInt();

    dimmsetNow[1] = server.arg("jasnosc2").toInt();
    jasnoscLED(1, dimmsetNow[1]);
    dimmsetMax[1] = server.arg("dimm2set_max").toInt();

    dimmsetNow[2] = server.arg("jasnosc3").toInt();
    jasnoscLED(2, dimmsetNow[2]);
    dimmsetMax[2] = server.arg("dimm3set_max").toInt();

    relayToff1 = server.arg("relayToff1").toInt();
    relayToff2 = server.arg("relayToff2").toInt();

    strcpy(ssid, server.arg("SSID").c_str());
    strcpy(password, server.arg("pass").c_str());
    wifiAPon = server.arg("wifiAPon").toInt();
    create_json();
    server.send(200, "application/json", json);
}

void handle_NotFound() {
    server.send(404, "text/plain", "Not found");
}
void index_html() {
    File file = SPIFFS.open("/index.html");
    server.streamFile(file, "text/HTML");
}
void css_css() {
}
void create_json() {
    json = "[{\"DevID\":" + String(DevID) +
           ",\"SubDevID\":" + String(SubDevID) +
           ",\"Flag\":" + String(Flag) +
           ",\"allFrame\":" + String(allFrame) +
           ",\"PALevel\":" + String(PALevel) +
           ",\"NRFchannel\":" + String(NRFchannel) +
           ",\"SW1TouchEnable\":" + String(SW1TouchEnable) +
           ",\"OTAActive\":" + String(OTAActive) +
           ",\"ServerActive\":" + String(ServerActive) +
           ",\"ResolutionLED\":" + String(ResolutionLED) +
           ",\"FreqLED\":" + String(FreqLED) +
           ",\"czasnazapisweeprom\":" + String(czasnazapisweeprom) +
           ",\"LightOnBoot\":" + String(LightOnBoot) +
           ",\"serialmode\":" + String(serialmode) +
           ",\"jasnosc1\":" + String(readEEPROM(0) * 256 + readEEPROM(1)) +
           ",\"jasnosc2\":" + String(readEEPROM(6) * 256 + readEEPROM(7)) +
           ",\"jasnosc3\":" + String(readEEPROM(8) * 256 + readEEPROM(9)) +
           ",\"dimmset_max\":" + String(dimmsetMax[0]) +
           ",\"dimm2set_max\":" + String(dimmsetMax[1]) +
           ",\"dimm3set_max\":" + String(dimmsetMax[2]) +
           ",\"DimUpDownResolution\":" + String(DimUpDownResolution) +
           ",\"RF24_rxAddr\":" + String((RF24_rxAddr >> 8) & 0xFF) +
           ",\"relayToff1\":" + String(relayToff1) +
           ",\"relayToff2\":" + String(relayToff2) +
           ",\"wifiAPon\":" + String(wifiAPon) +

           ",\"SSID\":\"" + String(ssid) +
           "\",\"pass\":\"" + String(password) +
           "\"},{\"frameID\":" + String(frameID) +
           ",\"celsius\":" + String(celsius) + "}]";
}

void handleRoot() {  // When URI / is requested, send a web page with a button
    // to toggle the LED
    server.send(
        200, "text/html",
        "<form action=\"/login\" method=\"POST\"><input type=\"text\" "
        "name=\"username\" placeholder=\"Username\"></br><input "
        "type=\"password\" name=\"password\" "
        "placeholder=\"Password\"></br><input type=\"submit\" "
        "value=\"Login\"></form><p>Try 'John Doe' and 'password123' ...</p>");
}
void handleLogin() {
    if (!server.hasArg("username") || !server.hasArg("password") || server.arg("username") == NULL || server.arg("password") == NULL) {
        server.send(400, "text/plain", "400: Invalid Request");
    }
    if (server.arg("username") == "John Doe" && server.arg("password") == "password123") {
        server.send(200, "text/html", "<h1>Welcome, " + server.arg("username") + "!</h1><p>Login successful</p>");
    } else {
        server.send(401, "text/plain", "401: Unauthorized");
    }
}

//<-- server

void zmiana_poziomu_jasnosci(uint16_t nrLED) {
    static uint64_t zapamietanyCzas1 = 0;
    static uint64_t zapamietanyCzas2 = 0;
    // dimmset_now = dimmsetLast[nrLED];
    if (aktualnyCzas - zapamietanyCzas2 >= 2000UL) {
        if (aktualnyCzas - zapamietanyCzas1 >= 200UL) {
            zapamietanyCzas1 = aktualnyCzas;

            if (dimming_up) {
                if (dimmsetNow[nrLED] < 15) {
                    dimmsetNow[nrLED] += 1;
                } else if ((dimmsetNow[nrLED] >= 15) && (dimmsetNow[nrLED] <= 40)) {
                    dimmsetNow[nrLED] += 5;
                } else {
                    dimmsetNow[nrLED] += DimUpDownResolution;
                }
            } else {
                if (dimmsetNow[nrLED] < 15) {
                    dimmsetNow[nrLED] -= 1;
                } else if ((dimmsetNow[nrLED] >= 15) && (dimmsetNow[nrLED] <= 40)) {
                    dimmsetNow[nrLED] -= 5;
                } else {
                    dimmsetNow[nrLED] -= DimUpDownResolution;
                }
            }

            if (dimmsetNow[nrLED] > dimmsetMax[nrLED]) {
                dimmsetNow[nrLED] = dimmsetMax[nrLED];
                zapamietanyCzas2 = aktualnyCzas;
            }
            if (dimmsetNow[nrLED] < dimmset_min) {
                dimmsetNow[nrLED] = dimmset_min;
                zapamietanyCzas2 = aktualnyCzas;
            }
            dimmsetLast[nrLED] = dimmsetNow[nrLED];
            // jasnosc = dimmsetNow[nrLED];

            jasnoscLED(nrLED, dimmsetNow[nrLED]);
        }
        if (dimmsetNow[nrLED] >= dimmsetMax[nrLED] || dimmsetNow[nrLED] <= dimmset_min) {
            dimming_up = !dimming_up;
        }
    }
}

void oneClick0() {
    uint8_t nrLED = 0;
    if (serialmode == 1) Serial.println("oneClick");
    //pierwszy raz po reset
    if (dimmsetNow[nrLED] == 0 && dimmsetLast[nrLED] == 0) {
        dimmsetNow[nrLED] = dimmsetMax[nrLED];
        dimmsetLast[nrLED] = dimmsetNow[nrLED];
        // jasnosc = dimmsetNow[nrLED];
        jasnoscLED(nrLED, dimmsetNow[nrLED]);
    }
    //wlaczamy na poprzedni poziom
    else if (dimmsetNow[nrLED] == 0) {
        dimmsetNow[nrLED] = dimmsetLast[nrLED];
        // jasnosc = dimmsetNow[nrLED];
        jasnoscLED(nrLED, dimmsetNow[nrLED]);
    }
    //wylaczamy
    else if (dimmsetNow[nrLED] > 0 && dimmsetLast[nrLED] <= dimmsetNow[nrLED]) {
        dimmsetNow[nrLED] = 0;
        // jasnosc = dimmsetNow[nrLED];
        jasnoscLED(nrLED, dimmsetNow[nrLED]);
    }
}
void DoubleClick0() {
    uint8_t nrLED = 0;
    if (serialmode == 1) Serial.println("DoubleClick");
    //wlaczamy na MAX
    if (dimmsetNow[nrLED] > 0 && dimmsetLast[0] < (dimmsetMax[nrLED] + 1) && dimmsetNow[nrLED] < (dimmsetMax[nrLED] + 1)) {
        dimmsetLast[nrLED] = dimmsetNow[nrLED];
        dimmsetNow[nrLED] = (dimmsetMax[nrLED] + 1);
        // jasnosc = dimmsetNow[nrLED];
        jasnoscLED(nrLED, dimmsetNow[nrLED]);
    }
    //wlaczamy na poprzedni poziom
    else if (dimmsetNow[nrLED] == (dimmsetMax[nrLED] + 1) && dimmsetLast[nrLED] != (dimmsetMax[nrLED] + 1)) {
        dimmsetNow[nrLED] = dimmsetLast[nrLED];
        // jasnosc = dimmsetNow[nrLED];
        jasnoscLED(nrLED, dimmsetNow[nrLED]);
    }
    //na MAX z wylaczonego
    else if (dimmsetNow[nrLED] == 0) {
        dimmsetNow[nrLED] = (dimmsetMax[nrLED] + 1);
        // jasnosc = dimmsetNow[nrLED];
        jasnoscLED(nrLED, dimmsetNow[nrLED]);
    }
}

void LongPressStart0() {
    uint8_t nrLED = 0;
    if (serialmode == 1) Serial.println("LongPressStart");
    button_is_long_pressed = 1;
    numDIM = nrLED;
}

void oneClick1() {
    uint8_t nrLED = 1;

    if (serialmode == 1) Serial.println("oneClick 1");
    //pierwszy raz po reset
    if (dimmsetNow[nrLED] == 0 && dimmsetLast[nrLED] == 0) {
        dimmsetNow[nrLED] = dimmsetMax[nrLED];
        dimmsetLast[nrLED] = dimmsetNow[nrLED];
        // jasnosc = dimmsetNow[nrLED];
        jasnoscLED(nrLED, dimmsetNow[nrLED]);

