IoTHomeJM/ESP32_Button_transmitter/src/main.cpp
    }
    //wlaczamy na poprzedni poziom
    else if (dimmsetNow[nrLED] == 0) {
        dimmsetNow[nrLED] = dimmsetLast[nrLED];
        // jasnosc = dimmsetNow[nrLED];
        jasnoscLED(nrLED, dimmsetNow[nrLED]);

    }
    //wylaczamy
    else if (dimmsetNow[nrLED] > 0 && dimmsetLast[nrLED] <= dimmsetNow[nrLED]) {
        dimmsetNow[nrLED] = 0;
        // jasnosc = dimmsetNow[nrLED];
        jasnoscLED(nrLED, dimmsetNow[nrLED]);
    }
}
void DoubleClick1() {
    uint8_t nrLED = 1;
    if (serialmode == 1) Serial.println("DoubleClick");
    //wlaczamy na MAX
    if (dimmsetNow[nrLED] > 0 && dimmsetLast[0] < (dimmsetMax[nrLED] + 1) && dimmsetNow[nrLED] < (dimmsetMax[nrLED] + 1)) {
        dimmsetLast[nrLED] = dimmsetNow[nrLED];
        dimmsetNow[nrLED] = (dimmsetMax[nrLED] + 1);
        // jasnosc = dimmsetNow[nrLED];
        jasnoscLED(nrLED, dimmsetNow[nrLED]);

    }
    //wlaczamy na poprzedni poziom
    else if (dimmsetNow[nrLED] == (dimmsetMax[nrLED] + 1) && dimmsetLast[nrLED] != (dimmsetMax[nrLED] + 1)) {
        dimmsetNow[nrLED] = dimmsetLast[nrLED];
        // jasnosc = dimmsetNow[nrLED];
        jasnoscLED(nrLED, dimmsetNow[nrLED]);

    }
    //na MAX z wylaczonego
    else if (dimmsetNow[nrLED] == 0) {
        dimmsetNow[nrLED] = (dimmsetMax[nrLED] + 1);
        // jasnosc = dimmsetNow[nrLED];
        jasnoscLED(nrLED, dimmsetNow[nrLED]);
    }
}

void LongPressStart1() {
    uint8_t nrLED = 1;
    if (serialmode == 1) Serial.println("LongPressStart");
    button_is_long_pressed = 1;
    numDIM = nrLED;
}

void oneClick2() {
    uint8_t nrLED = 2;
    if (serialmode == 1) Serial.println("oneClick");
    //pierwszy raz po reset
    if (dimmsetNow[nrLED] == 0 && dimmsetLast[nrLED] == 0) {
        dimmsetNow[nrLED] = dimmsetMax[nrLED];
        dimmsetLast[nrLED] = dimmsetNow[nrLED];
        // jasnosc = dimmsetNow[nrLED];
        jasnoscLED(nrLED, dimmsetNow[nrLED]);
    }
    //wlaczamy na poprzedni poziom
    else if (dimmsetNow[nrLED] == 0) {
        dimmsetNow[nrLED] = dimmsetLast[nrLED];
        // jasnosc = dimmsetNow[nrLED];
        jasnoscLED(nrLED, dimmsetNow[nrLED]);
    }
    //wylaczamy
    else if (dimmsetNow[nrLED] > 0 && dimmsetLast[nrLED] <= dimmsetNow[nrLED]) {
        dimmsetNow[nrLED] = 0;
        // jasnosc = dimmsetNow[nrLED];
        jasnoscLED(nrLED, dimmsetNow[nrLED]);
    }
}
void DoubleClick2() {
    uint8_t nrLED = 2;
    if (serialmode == 1) Serial.println("DoubleClick");
    //wlaczamy na MAX
    if (dimmsetNow[nrLED] > 0 && dimmsetLast[0] < (dimmsetMax[nrLED] + 1) && dimmsetNow[nrLED] < (dimmsetMax[nrLED] + 1)) {
        dimmsetLast[nrLED] = dimmsetNow[nrLED];
        dimmsetNow[nrLED] = (dimmsetMax[nrLED] + 1);
        // jasnosc = dimmsetNow[nrLED];
        jasnoscLED(nrLED, dimmsetNow[nrLED]);
    }
    //wlaczamy na poprzedni poziom
    else if (dimmsetNow[nrLED] == (dimmsetMax[nrLED] + 1) && dimmsetLast[nrLED] != (dimmsetMax[nrLED] + 1)) {
        dimmsetNow[nrLED] = dimmsetLast[nrLED];
        // jasnosc = dimmsetNow[nrLED];
        jasnoscLED(nrLED, dimmsetNow[nrLED]);
    }
    //na MAX z wylaczonego
    else if (dimmsetNow[nrLED] == 0) {
        dimmsetNow[nrLED] = (dimmsetMax[nrLED] + 1);
        // jasnosc = dimmsetNow[nrLED];
        jasnoscLED(nrLED, dimmsetNow[nrLED]);
    }
}
void LongPressStart2() {
    uint8_t nrLED = 2;
    if (serialmode == 1) Serial.println("LongPressStart");
    button_is_long_pressed = 1;
    numDIM = nrLED;
}
void LongPressStop() {
    if (serialmode == 1) Serial.println("LongPressStop");
    button_is_long_pressed = 0;
}

//<-- DLA dimmer
void jasnoscLED(uint8_t nrLED, uint16_t jas) {
    uint16_t TMPjasnosc = 0, TMPjasnosc2 = 0, TMPjasnosc3 = 0;

    switch (nrLED) {
        case 0:
            sendNRF(3, jas);
            sendCAN(DevID, 3, jas, 0);

            //led[0].setupMax(jas);
            eepromBUF[0] = readEEPROM(0);
            eepromBUF[1] = readEEPROM(1);
            TMPjasnosc = eepromBUF[0] * 256 + eepromBUF[1];  // odczyt zapisanej jasnosci
            if ((jas > 0 && jas < dimmsetMax[0] - 1 && TMPjasnosc != jas)) {
                dim1 = 1;
            } else {
                dim1 = 0;
            }
            break;
        case 1:
            sendNRF(4, jas);
            sendCAN(DevID, 4, jas, 0);

            //led[1].setupMax(jas);
            eepromBUF[6] = readEEPROM(6);
            eepromBUF[7] = readEEPROM(7);
            TMPjasnosc2 = eepromBUF[6] * 256 + eepromBUF[7];
            if ((jas > 0 && jas < dimmsetMax[1] - 1 && TMPjasnosc2 != jas)) {
                dim2 = 1;
            } else {
                dim2 = 0;
            }
            break;
        case 2:

            sendNRF(5, jas);
            sendCAN(DevID, 5, jas, 0);

            //led[2].setupMax(jas);
            eepromBUF[8] = readEEPROM(8);
            eepromBUF[9] = readEEPROM(9);
            TMPjasnosc3 = eepromBUF[8] * 256 + eepromBUF[9];
            if ((jas > 0 && jas < dimmsetMax[2] - 1 && TMPjasnosc3 != jas)) {
                dim3 = 1;
            } else {
                dim3 = 0;
            }
            break;
        case 4:
            break;
    }
    numDIM = nrLED;
    rysuj_jasnosc_na_lcd(nrLED);

    if (dim1 == 1 || dim2 == 1 || dim3 == 1) {
        zapamietanyCzas1 = aktualnyCzas;
        zapiszweeprom = 1;
    }
}

//--> eeprom
void DimmWriteEEPROM() {  // zapisywanie z opoznienim aktualnej nastawy jasnosci LED do EEPROM
    if (aktualnyCzas - zapamietanyCzas1 >= czasnazapisweeprom) {
        if (dim1 == 1) {
            if (aktualnyCzas - zapamietanyCzasEEPROM >= 6) {
                dim1 = 0;
                if (serialmode == 1) Serial.println("Zapisywanie w EEPROM DIM 1 ...");
                writeEEPROM(0, dimmsetNow[0], 2);
            }
        }
        if (dim2 == 1) {
            if (aktualnyCzas - zapamietanyCzasEEPROM >= 6) {
                dim2 = 0;
                if (serialmode == 1) Serial.println("Zapisywanie w EEPROM DIM 2 ...");
                writeEEPROM(6, dimmsetNow[1], 2);
            }
        }
        if (dim3 == 1) {
            if (aktualnyCzas - zapamietanyCzasEEPROM >= 6) {
                dim3 = 0;
                if (serialmode == 1) Serial.println("Zapisywanie w EEPROM DIM 3 ...");
                writeEEPROM(8, dimmsetNow[2], 2);
            }
        }
        if (dim1 == 0 && dim2 == 0 && dim3 == 0) {
            zapiszweeprom = 0;
        }
    }
}
void writeEEPROM(unsigned int adres, uint16_t dane, uint8_t dlugosc) {
    Wire.beginTransmission(eeprom);
    Wire.write((int)(adres >> 8));    // MSB
    Wire.write((int)(adres & 0xFF));  // LSB
    switch (dlugosc) {
        case 1:
            Wire.write((byte)(dane & 0xFF));
            break;
        case 2:
            Wire.write((byte)(dane >> 8));
            Wire.write((byte)(dane & 0xFF));
            break;
    }
    Wire.endTransmission();
    if (serialmode == 1) {
        Serial.println("Zapis EEPROM ok");
    }
    zapamietanyCzasEEPROM = aktualnyCzas;
}
void writeStringToEEPROM(int adres, const String& ToWrite) {
    byte size = ToWrite.length();
    writeEEPROM(adres, size, 1);
    Serial.println(size);
    delay(6);
    for (int i = 0; i < size; i++) {
        adres++;
        writeEEPROM(adres, ToWrite[i], 1);
        Serial.print(ToWrite[i]);
        Serial.println(adres);
        delay(6);
    }
    // delay(100);
}

