IoTHomeJM/ESP32_Button_transmitter/src/main.cpp
String readStringFromEEPROM(int addrOffset) {
    int newStrLen = readEEPROM(addrOffset);
    char data[newStrLen + 1];
    if (newStrLen <= 32) {
        for (int i = 0; i < newStrLen; i++) {
            data[i] = readEEPROM(addrOffset + 1 + i);
        }
        data[newStrLen] = '\0';
        // data[newStrLen] = "\/ 0";  // !!! NOTE !!! Remove the space between the slash "/" and "0" (I've added a space because otherwise there is a display bug)
    } else {
        if (serialmode == 1) Serial.print("Blad odczytu Strina z eeprom-za dlugi");
    }
    return String(data);
}
void SettingWriteEEPROM() {
    if (serialmode == 1) Serial.print("Zapisywanie ustawien...");

    // writeEEPROM(37, wifiAPon, 1);
    delay(6);
    writeEEPROM(36, wifiAPon, 1);
    delay(6);
    writeStringToEEPROM(2033, password);
    writeStringToEEPROM(2000, ssid);
    delay(6);
    writeEEPROM(34, relayToff2, 2);  //34,35
    delay(6);
    writeEEPROM(32, relayToff1, 2);  // 32, 33
    delay(6);
    writeEEPROM(31, ((RF24_rxAddr >> 8) & 0xFF), 1);
    delay(6);
    writeEEPROM(29, dimmsetMax[2], 2);  // 29,30 BAJT dimmsetMax[2] MSB
    delay(6);
    writeEEPROM(27, dimmsetMax[1], 2);  // 27,28 BAJT dimmsetMax[1] MSB
    delay(6);
    writeEEPROM(26, DimUpDownResolution, 1);
    delay(6);
    writeEEPROM(24, dimmsetMax[0], 2);
    delay(6);
    writeEEPROM(23, serialmode, 1);  // 23 BAJT serialmode
    delay(6);
    writeEEPROM(21, czasnazapisweeprom, 2);  // 21,22 BAJT czasnazapisweeprom MSB
    delay(6);
    writeEEPROM(19, FreqLED, 2);  // 19,20 BAJT FreqLED MSB 1388
    delay(6);
    writeEEPROM(18, ResolutionLED, 1);  // 18 BAJT ResolutionLED
    delay(6);
    writeEEPROM(17, ServerActive, 1);  // 17 BAJT ServerActive
    delay(6);
    writeEEPROM(16, OTAActive, 1);  // 16 BAJT OTAActive
    delay(6);
    writeEEPROM(15, SW1TouchEnable, 1);  // 15 BAJT SW1TouchEnable
    delay(6);
    writeEEPROM(14, NRFchannel, 1);  // 14 BAJT NRFchannel
    delay(6);
    writeEEPROM(13, PALevel, 1);  // 13 BAJT PALevel
    delay(6);
    writeEEPROM(12, allFrame, 1);  // 12 BAJT allFrame
    delay(6);
    writeEEPROM(11, Flag, 1);  // 11 BAJT Flag
    delay(6);
    writeEEPROM(10, LightOnBoot, 1);  // 10 BAJT LightOnBoot
    delay(6);
    writeEEPROM(8, dimmsetNow[2], 2);  // 8,9 BAJT DIM3 jasnosc MSB
    delay(6);
    writeEEPROM(6, dimmsetNow[1], 2);  // 6,7 BAJT DIM2 jasnosc MSB
    delay(6);
    writeEEPROM(5, SubDevID, 1);  // 5 BAJT SubDevID
    delay(6);
    writeEEPROM(4, DevID, 1);  // 4 BAJT devID
    delay(6);
    writeEEPROM(0, dimmsetNow[0], 2);  // 0,1 BAJT dim1 jasnosc MSB

    if (serialmode == 1) Serial.println("... zakonczone. Reset ESP.");
    SettingSave = 0;
    if (ServerActive == 0) {
        wificlose();
    } else {
        ESP.restart();
    }
}
void FactoryWriteEEPROM() {
    if (serialmode == 1) Serial.print("Ustawienia fabryczne...");
    writeEEPROM(36, 1, 1);
    delay(6);
    writeStringToEEPROM(2000, "ssid");
    writeStringToEEPROM(2033, "pass");
    writeEEPROM(34, 5000, 2);  //34,35
    delay(6);
    writeEEPROM(32, 5000, 2);  // 32, 33
    delay(6);
    writeEEPROM(31, 0, 1);  // RF24_rxAddr
    delay(6);
    writeEEPROM(29, 999, 2);  // 29,30 BAJT dimmsetMax[2] MSB
    delay(6);
    writeEEPROM(27, 999, 2);  // 27,28 BAJT dimmsetMax[1] MSB
    delay(6);
    writeEEPROM(26, 20, 1);  // 26 DimUpDownResolution
    delay(6);
    writeEEPROM(24, 999, 2);  // 24, 25 dimmsetMax[0]
    delay(6);
    writeEEPROM(23, 1, 1);  // 23 BAJT serialmode
    delay(6);
    writeEEPROM(21, 6000, 2);  // 21,22 BAJT czasnazapisweeprom MSB
    delay(6);
    writeEEPROM(19, 25000, 2);  // 19,20 BAJT FreqLED MSB 1388
    delay(6);
    writeEEPROM(18, 10, 1);  // 18 BAJT ResolutionLED
    delay(6);
    writeEEPROM(17, 1, 1);  // 17 BAJT ServerActive
    delay(6);
    writeEEPROM(16, 0, 1);  // 16 BAJT OTAActive
    delay(6);
    writeEEPROM(15, 0, 1);  // 15 BAJT SW1TouchEnable
    delay(6);
    writeEEPROM(14, 1, 1);  // 14 BAJT NRFchannel
    delay(6);
    writeEEPROM(13, 1, 1);  // 13 BAJT PALevel
    delay(6);
    writeEEPROM(12, 1, 1);  // 12 BAJT allFrame
    delay(6);
    writeEEPROM(11, 1, 1);  // 11 BAJT Flag
    delay(6);
    writeEEPROM(10, 1, 1);  // 10 BAJT LightOnBoot
    delay(6);
    writeEEPROM(8, 6, 2);  // 8,9 BAJT DIM3 jasnosc MSB
    delay(6);
    writeEEPROM(6, 6, 2);  // 6,7 BAJT DIM2 jasnosc MSB
    delay(6);
    writeEEPROM(5, 0, 1);  // 5 BAJT SubDevID
    delay(6);
    writeEEPROM(4, 0, 1);  // 4 BAJT devID
    // delay(6);writeEEPROM(2,998,2);  // wolne
    delay(6);
    writeEEPROM(0, 6, 2);  // 0,1 BAJT dim1 jasnosc MSB
    if (serialmode == 1) Serial.println("... zakonczone. Reset ESP.");
    FactorySet = 0;
    ESP.restart();
}

byte readEEPROM(unsigned int eeaddress) {
    byte rdata = 0xFF;
    Wire.beginTransmission(eeprom);
    Wire.write((int)(eeaddress >> 8));    // MSB
    Wire.write((int)(eeaddress & 0xFF));  // LSB
    Wire.endTransmission();
    Wire.requestFrom(eeprom, 1);
    if (Wire.available()) rdata = Wire.read();
    return rdata;
}

void rysuj_jasnosc_na_lcd(uint16_t nrLED) {
    if (dimActivNumb == 3) {
        int val = map(dimmsetNow[0], 0, dimmsetMax[0], 0, 37);
        if (val < 1 && dimmsetNow[0] > 0) {
            val = 1;
        }
        display.fillRoundRect(2, 2, 37, 11, zaok, BLACK);
        display.fillRoundRect(2, 2, val, 11, zaok, WHITE);
        // napisy na pasku jasnosci
        if (dimmsetNow[0] == 0) {
            display.setCursor(5, 4);
            display.println("O F F");
        }
        if (dimmsetNow[0] == 2) {
            display.setCursor(5, 4);
            display.println("M I N");
        }
        if (dimmsetNow[0] == (dimmsetMax[0] + 1)) {
            display.setTextColor(BLACK);
            display.setCursor(10, 4);
            display.println("FULL");
            display.setTextColor(WHITE);
        }
        if (dimmsetNow[0] == dimmsetMax[0]) {
            display.setTextColor(BLACK);
            display.setCursor(5, 4);
            display.println("M A X");
            display.setTextColor(WHITE);
        }

        int val1 = map(dimmsetNow[1], 0, dimmsetMax[1], 0, 37);
        if (val1 < 1 && dimmsetNow[1] > 0) {
            val1 = 1;
        }
        display.fillRoundRect(45, 2, 37, 11, zaok, BLACK);
        display.fillRoundRect(45, 2, val1, 11, zaok, WHITE);
        // napisy na pasku jasnosci
        if (dimmsetNow[1] == 0) {
            display.setCursor(50, 4);
            display.println("O F F");
        }
        if (dimmsetNow[1] == 2) {
            display.setCursor(50, 4);
            display.println("M I N");
        }
        if (dimmsetNow[1] == (dimmsetMax[1] + 1)) {
            display.setTextColor(BLACK);
            display.setCursor(55, 4);
            display.println("FULL");
            display.setTextColor(WHITE);
        }
        if (dimmsetNow[1] == dimmsetMax[1]) {
            display.setTextColor(BLACK);
            display.setCursor(50, 4);
            display.println("M A X");
            display.setTextColor(WHITE);
        }

