IoTHomeJM/ESP32_Button_transmitter/src/main.cpp
        int val2 = map(dimmsetNow[2], 0, dimmsetMax[2], 0, 37);
        if (val2 < 1 && dimmsetNow[2] > 0) {
            val2 = 1;
        }
        display.fillRoundRect(88, 2, 37, 11, zaok, BLACK);
        display.fillRoundRect(88, 2, val2, 11, zaok, WHITE);
        // napisy na pasku jasnosci
        if (dimmsetNow[2] == 0) {
            display.setCursor(93, 4);
            display.println("O F F");
        }
        if (dimmsetNow[2] == 2) {
            display.setCursor(93, 4);
            display.println("M I N");
        }
        if (dimmsetNow[2] == (dimmsetMax[1] + 1)) {
            display.setTextColor(BLACK);
            display.setCursor(98, 4);
            display.println("FULL");
            display.setTextColor(WHITE);
        }
        if (dimmsetNow[2] == dimmsetMax[1]) {
            display.setTextColor(BLACK);
            display.setCursor(93, 4);
            display.println("M A X");
            display.setTextColor(WHITE);
        }
    } else if (dimActivNumb == 1) {
        int val = map(dimmsetNow[nrLED], 0, dimmsetMax[nrLED], 0, 95);
        if (val < 1 && dimmsetNow[nrLED] > 0) {
            val = 1;
        }
        display.fillRect(16, 2, 95, 11, BLACK);
        display.fillRect(16, 2, val, 11, WHITE);

        // napisy na pasku jasnosci
        if (dimmsetNow[nrLED] == 0) {
            display.setCursor(52, 4);
            display.println("O F F");
        }
        if (dimmsetNow[nrLED] == 2) {
            display.setCursor(52, 4);
            display.println("M I N");
        }
        if (dimmsetNow[nrLED] == (dimmsetMax[nrLED] + 1)) {
            display.setTextColor(BLACK);
            display.setCursor(43, 4);
            display.println("F U L L");
            display.setTextColor(WHITE);
        }
        if (dimmsetNow[nrLED] == dimmsetMax[nrLED]) {
            display.setTextColor(BLACK);
            display.setCursor(50, 4);
            display.println("M A X");
            display.setTextColor(WHITE);
        }

        if (poRestarcieTestSW1) {
            display.setCursor(17, 4);
            display.println("START:");
        }  // wyswietlamy tylko przy pierwszym starcie lub restarcie procka
        if (poRestarcieTestSW1 && dimmsetNow[nrLED] > 0) {
            poRestarcieTestSW1 = 0;
        }
    } else if (dimActivNumb == 2) {
        int val = map(dimmsetNow[0], 0, dimmsetMax[0], 0, 58);
        if (val < 1 && dimmsetNow[0] > 0) {
            val = 1;
        }
        display.fillRoundRect(2, 2, 58, 11, zaok, BLACK);
        display.fillRoundRect(2, 2, val, 11, zaok, WHITE);
        // napisy na pasku jasnosci
        if (dimmsetNow[0] == 0) {
            display.setCursor(5, 4);
            display.println("O F F");
        }
        if (dimmsetNow[0] == 2) {
            display.setCursor(5, 4);
            display.println("M I N");
        }
        if (dimmsetNow[0] == (dimmsetMax[0] + 1)) {
            display.setTextColor(BLACK);
            display.setCursor(10, 4);
            display.println("FULL");
            display.setTextColor(WHITE);
        }
        if (dimmsetNow[0] == dimmsetMax[0]) {
            display.setTextColor(BLACK);
            display.setCursor(5, 4);
            display.println("M A X");
            display.setTextColor(WHITE);
        }

        int val1 = map(dimmsetNow[1], 0, dimmsetMax[1], 0, 58);
        if (val1 < 1 && dimmsetNow[1] > 0) {
            val1 = 1;
        }
        display.fillRoundRect(66, 2, 58, 11, zaok, BLACK);
        display.fillRoundRect(66, 2, val1, 11, zaok, WHITE);
        // napisy na pasku jasnosci
        if (dimmsetNow[1] == 0) {
            display.setCursor(71, 4);  //+5
            display.println("O F F");
        }
        if (dimmsetNow[1] == 2) {
            display.setCursor(71, 4);
            display.println("M I N");
        }
        if (dimmsetNow[1] == (dimmsetMax[1] + 1)) {
            display.setTextColor(BLACK);
            display.setCursor(76, 4);
            display.println("FULL");
            display.setTextColor(WHITE);
        }
        if (dimmsetNow[1] == dimmsetMax[1]) {
            display.setTextColor(BLACK);
            display.setCursor(71, 4);
            display.println("M A X");
            display.setTextColor(WHITE);
        }
    }
    if (poRestarcieTestSW1) {
        display.setCursor(5, 4);
        display.println("|");
    }  // wyswietlamy tylko przy pierwszym starcie lub restarcie procka
    if (poRestarcieTestSW1 && dimmsetNow[nrLED] > 0) {
        poRestarcieTestSW1 = 0;
    }
    display.display();
}

void rysujemy_na_lcd() {
    if (checkOne1 == 1) {
        if (dimmsetLast[0] != 0) {
            dimActivNumb++;
        }
        if (dimmsetLast[1] != 0) {
            dimActivNumb++;
        }
        if (dimmsetLast[2] != 0) {
            dimActivNumb++;
        }
        checkOne1 = 0;
    }
    display.clearDisplay();
    display.setTextSize(1);
    display.setTextColor(WHITE);
    if (dimActivNumb == 3) {
        display.drawRoundRect(0, 0, 41, 15, zaok, WHITE);
        display.drawRoundRect(43, 0, 41, 15, zaok, WHITE);
        display.drawRoundRect(86, 0, 41, 15, zaok, WHITE);
    } else if (dimActivNumb == 1) {
        display.drawRoundRect(14, 0, 99, 15, 2, WHITE);
        display.drawCircle(5, 7, 5, WHITE);
        display.drawLine(2, 4, 8, 10, WHITE);
        display.drawLine(2, 10, 8, 4, WHITE);
        display.fillCircle(122, 7, 5, WHITE);
        display.drawLine(119, 4, 125, 10, BLACK);
        display.drawLine(119, 10, 125, 4, BLACK);
    } else if (dimActivNumb == 2) {
        display.drawRoundRect(0, 0, 62, 15, zaok, WHITE);
        display.drawRoundRect(64, 0, 62, 15, zaok, WHITE);
    }
    aktualizuj_timestr();
    display.setCursor(0, 16);
    display.print(timestr);
    display.print("   ");

    display.print("R1:");
    display.print(sp[0]);
    display.print("|");
    display.print("R2:");
    display.print(sp[1]);

    if (SMSbuf != "") {
        if (aktualnyCzas - zapamietanyCzasOLED >= smsoled) {
            SMSbuf = "";
        }
        display.setCursor(0, 24);
        display.print(getsmstel());
        display.setCursor(0, 32);
        display.print(SMSbuf);

    } else {
        display.setCursor(0, 24);
        display.print("CAN ID: 0x");
        display.println(frameID, HEX);  // CAN-BUS ID

        display.setCursor(0, 32);
        display.print("NRF: ");
        display.print(NRFbuf[0]);
        display.print(", ");
        display.println(NRFbuf[2] * 256 + NRFbuf[1]);
        display.setCursor(100, 32);
        display.print("PA:");
        display.println(radio.getPALevel());

        display.setFont(&FreeSansBold24pt7b);
        // dwie wersje wyswietlania temperatury, druga z miejscem dziesietnym
        display.setCursor(20, 60);
        char odczyt[4];
        dtostrf(celsius, 3, 0, odczyt);
        display.drawCircle(90, 39, 3, WHITE);
        if (celsius == -99) {
            display.print(" --");
        } else {
            display.print(odczyt);
        }
        // display.setCursor(0,60); char odczyt[5]; dtostrf(celsius,3, 1, odczyt); display.print(odczyt); display.drawCircle(95,39,3, WHITE);
        display.setFont(&FreeSans12pt7b);
        display.print(" C");
        display.setFont();

